app/controllers/gardens_controller.rb

SELECT * FROM "gardens"
---
  def index
    @gardens = Garden.find_all_by_is_public(true)
    @private_gardens = Garden.find_all_by_is_public(false)

    respond_to do |format|
      format.html # index.html.erb
      format.xml  { render :xml => @gardens }
      format.json  { render :json => @gardens.map {|g| g.id } }

SELECT * FROM "gardens" WHERE ("gardens"."id" = 1)
---
  def show
    @garden = Garden.find(params[:id])

INSERT INTO "gardens" ("name", "city", "created_at", "public", "updated_at", "info", "height", "password", "width", "state") VALUES('Karl Linn', 'Berkeley', '2011-04-24 08:14:25', 't', '2011-04-24 08:14:25', '', NULL, NULL, NULL, 'CA')
---
  def create
    @garden = Garden.new(params[:garden])

    respond_to do |format|
      if @garden.save